In [1]:
import pandas as pd
import sqlite3
# Conectamos con la base de datos chinook.db
connection = sqlite3.connect("./Data/sql-murder-mystery.db")
# Obtenemos un cursor que utilizaremos para hacer las queries
cursor_clase = connection.cursor()

def sql_query(query):

    # Ejecuta la query
    cursor_clase.execute(query) 

    # Almacena los datos de la query 
    ans = cursor_clase.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in cursor_clase.description]

    return pd.DataFrame(ans,columns=names)

In [15]:
query = '''
SELECT *
FROM crime_scene_report
WHERE city = "SQL City" 
'''
df = sql_query(query)
df["description"][8]

'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".'

Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave"

In [19]:
query = '''
SELECT *
FROM person
WHERE address_street_name = "Northwestern Dr"
ORDER BY address_number
'''
sql_query(query)

,id,name,license_id,address_number,address_street_name,ssn
0,89906,Kinsey Erickson,510019,309,Northwestern Dr,635287661
1,15171,Weldon Penso,336999,311,Northwestern Dr,131379495
2,40336,Fredia Billeter,251082,404,Northwestern Dr,108056488
3,85280,Donn Duin,569122,540,Northwestern Dr,613873810
4,12711,Norman Apolito,667757,599,Northwestern Dr,778264744
5,75484,Del Tacderen,447887,607,Northwestern Dr,243821337
6,26758,Angelena Billman,942074,629,Northwestern Dr,341854756
7,39688,Abe Roeker,537445,689,Northwestern Dr,438969447
8,10010,Muoi Cary,385336,741,Northwestern Dr,828638512
9,40760,Renata Faver,976650,745,Northwestern Dr,547572040
10,25615,Olevia Morena,388477,812,Northwestern Dr,962831331
11,99826,Ivy Kazarian,994470,892,Northwestern Dr,208359813
12,44542,Ivory Mcgrevey,873842,897,Northwestern Dr,988557407
13,55130,Shiloh Huntoon,472118,951,Northwestern Dr,826647644
14,33415,Homer Simpson,108392,981,Northwestern Dr,871392019
15,29608,Willetta Lurvey,800568,1028,Northwestern Dr,843751378
16,18376,Josh Shi,653712,1091,Northwestern Dr,193899001
17,22239,Dusty Sigafus,710517,1125,Northwestern Dr,724386723
18,70485,Andera Kostelecky,354822,1252,Northwestern Dr,787423012
19,23960,Kristopher Lagerberg,658777,1392,Northwestern Dr,492912529
20,71924,Laurie Scronce,774116,1418,Northwestern Dr,254883636
21,81052,Calvin Czelusniak,471483,1516,Northwestern Dr,657531837
22,72076,Courtney Bordeaux,324614,1707,Northwestern Dr,347966356
23,51552,Bonita Knie,764124,1726,Northwestern Dr,597137908
24,88423,Teri Ehrich,510876,1879,Northwestern Dr,248637345
25,81885,Kurtis Masuda,934201,2108,Northwestern Dr,201272595
26,96178,Galina Khuu,450248,2183,Northwestern Dr,398518185
27,80921,Donovan Yackley,222395,2386,Northwestern Dr,515049359
28,34352,Vincenza Burkhardt,436470,2512,Northwestern Dr,197913046
29,53699,Christian Pagano,628433,2585,Northwestern Dr,644772304
30,54564,Sammie Sengun,217286,2590,Northwestern Dr,848854310
31,90397,Dionna Kranwinkle,797260,2678,Northwestern Dr,278964807
32,34155,Allyson Lazenson,814209,2840,Northwestern Dr,991150469
33,59307,Cyril Yongue,753524,2903,Northwestern Dr,866057839
34,98593,Jonah Toner,578982,2947,Northwestern Dr,745853548
35,44004,Alison Eska,327797,2951,Northwestern Dr,306417867
36,68690,Yer Modest,852404,3046,Northwestern Dr,419238039
37,51114,Christena Saffell,814284,3055,Northwestern Dr,247657547
38,23044,Val Portlock,924989,3143,Northwestern Dr,100593316
39,28360,Rashad Cascone,924517,3212,Northwestern Dr,838907424
40,53076,Boris Bijou,664914,3327,Northwestern Dr,401191868
41,36378,Freddie Ellzey,267882,3449,Northwestern Dr,474117596
42,87456,Leonora Wolfsberger,215868,3483,Northwestern Dr,565203106
43,93509,Emmitt Aceuedo,916706,3491,Northwestern Dr,979073160
44,19420,Cody Schiel,890431,3524,Northwestern Dr,947110049
45,96595,Coretta Cubie,303645,3631,Northwestern Dr,378403829
46,73368,Torie Thalmann,773862,3697,Northwestern Dr,341559436
47,53890,Sophie Tiberio,957671,3755,Northwestern Dr,442830147
48,17729,Lasonya Wildey,439686,3824,Northwestern Dr,917817122
49,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

Morty Schapiro en el 4919 de Northwestern Dr

In [21]:
query = '''
SELECT *
FROM person
WHERE address_street_name = "Franklin Ave"
ORDER BY name
'''
sql_query(query)

,id,name,license_id,address_number,address_street_name,ssn
0,33793,Amado Mattan,161915,99,Franklin Ave,125205748
1,16371,Annabel Miller,490173,103,Franklin Ave,318771143
2,46827,Bev Billiter,643591,2316,Franklin Ave,940192302
3,78658,Blake Chrones,310242,2014,Franklin Ave,423048084
4,97913,Cameron Dilick,971988,2954,Franklin Ave,665147939
5,78830,Candice Train,814779,3255,Franklin Ave,717570815
6,18651,Carleen Etoll,356746,22,Franklin Ave,193369255
7,30654,Clarita Rickels,418084,2254,Franklin Ave,714941023
8,61437,Colette Hollomon,661377,453,Franklin Ave,314956038
9,34592,Cordell Lindamood,592762,3657,Franklin Ave,509890333
10,78408,Dante Eschen,218173,3447,Franklin Ave,135374633
11,36328,Domenic Laun,971080,3809,Franklin Ave,825329637
12,84531,Edgar Mendieta,315790,3881,Franklin Ave,458847132
13,52075,Ezra Phy,928109,384,Franklin Ave,176404498
14,24737,Gema Nantz,273410,3968,Franklin Ave,180545802
15,78170,Graig Summy,192325,3387,Franklin Ave,277793306
16,54817,Guy Bustard,213929,591,Franklin Ave,820850670
17,95119,Hong Lisa,825828,375,Franklin Ave,113438176
18,69719,Hope Arzabala,311724,841,Franklin Ave,270289620
19,62292,Isaiah Holsten,913856,747,Franklin Ave,995368430
20,17683,Johnnie Schee,968887,1277,Franklin Ave,815977821
21,98744,Jordan Myntti,256116,3104,Franklin Ave,876030104
22,52059,Jordan Pelton,686854,2786,Franklin Ave,676224073
23,37616,Katelyn Schwerin,430143,332,Franklin Ave,392365033
24,61001,Laurine Bousman,197150,247,Franklin Ave,431360364
25,57051,Lavette Koehl,137365,2284,Franklin Ave,776046786
26,83754,Maria Walsh,201334,2716,Franklin Ave,121282864
27,62520,Mariah Lepetich,450447,3086,Franklin Ave,797745632
28,87521,Moses Ikerd,638991,2283,Franklin Ave,797715435
29,36400,Noe Pancoast,895755,3443,Franklin Ave,732212073
30,93947,Omer Andreoni,605718,13,Franklin Ave,322594288
31,54896,Patty Wamsley,688488,1097,Franklin Ave,725272037
32,88966,Raul Eads,570927,2066,Franklin Ave,764132739
33,67292,Renita Roperto,801041,625,Franklin Ave,894442480
34,76128,Ressie Razze,633497,1199,Franklin Ave,456366143
35,60944,Ricki Bidding,443364,2072,Franklin Ave,614976330
36,59746,Ronny Gumbert,469722,3197,Franklin Ave,561067477
37,75510,Sebastian Ramnarase,333188,1127,Franklin Ave,315716580
38,32264,Shelby Dezeeuw,735415,1391,Franklin Ave,143197463
39,70050,Whitney Herkenratt,138462,3445,Franklin Ave,552518972
40,56142,William Shiver,741336,1926,Franklin Ave,219913461
41,83003,Wilmer Casella,672050,3564,Franklin Ave,569057540
42,12207,Wilmer Wolever,509484,139,Franklin Ave,636825374
43,52121,Yelena Whitler,427830,3185,Franklin Ave,115106155
44,22636,Zachary Ybarbo,768359,785,Franklin Ave,285346605

Annabel Miller en el 103 de Franklin Ave

In [28]:
query = '''
SELECT a.name, b.transcript
FROM person as A
INNER JOIN interview as B
ON a.id = b.person_id
WHERE name = "Morty Schapiro"
'''
df = sql_query(query)
df["transcript"][0]

'I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".'

El sospechoso es un hombre, miembro GOLD del gym, su número de miembro empieza en 48Z, y su matrícula del coche incluye H42W

In [29]:
query = '''
SELECT a.name, b.transcript
FROM person as A
INNER JOIN interview as B
ON a.id = b.person_id
WHERE name = "Annabel Miller"
'''
df = sql_query(query)
df["transcript"][0]

'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.'

El asesino fue al gym el 9 de enero

In [48]:
query = '''
SELECT a.name, b.membership_status, c.membership_id
FROM person as A
INNER JOIN get_fit_now_member as B
ON a.id = b.person_id
INNER JOIN get_fit_now_check_in as C
ON b.id = c.membership_id AND c.membership_id LIKE "48Z%"
WHERE b.membership_status = "gold"
'''
df = sql_query(query)
df

            name membership_status membership_id
0   Joe Germuska              gold         48Z7A
1  Jeremy Bowers              gold         48Z55

2 sospechosos: Joe Germuska y Jeremy Bowers

In [50]:
query = '''
SELECT a.name
FROM person as A
INNER JOIN drivers_license as B
ON a.license_id = b.id
WHERE b.plate_number LIKE "%H42W%"
'''
sql_query(query)

             name
0  Tushar Chandra
1   Jeremy Bowers
2  Maxine Whitely

NUESTRO SOSPECHOSO ES JEREMYYY BOWERS!!

In [53]:
query = '''
SELECT a.name, b.membership_status, c.membership_id, c.check_in_date
FROM person as A
INNER JOIN get_fit_now_member as B
ON a.id = b.person_id
INNER JOIN get_fit_now_check_in as C
ON b.id = c.membership_id
WHERE check_in_date = "20180109"
'''
df = sql_query(query)
df

                name membership_status membership_id  check_in_date
0     Shondra Ledlow            silver         X0643       20180109
1   Zackary Cabotage            silver         UK1F2       20180109
2     Sarita Bartosh              gold         XTE42       20180109
3   Adriane Pelligra            silver         1AE2H       20180109
4      Burton Grippe              gold         6LSTG       20180109
5  Blossom Crescenzo           regular         7MWHJ       20180109
6      Carmen Dimick              gold         GE5Q8       20180109
7       Joe Germuska              gold         48Z7A       20180109
8      Jeremy Bowers              gold         48Z55       20180109
9     Annabel Miller              gold         90081       20180109

Jeremy Bowers es aún más sospechoso...

In [54]:
query = '''
SELECT *
FROM person
WHERE name = "Jeremy Bowers"

'''
sql_query(query)

,id,name,license_id,address_number,address_street_name,ssn
0,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279

In [56]:
query = '''
SELECT a.name, b.transcript
FROM person as A
INNER JOIN interview as B
ON a.id = b.person_id
WHERE name = "Jeremy Bowers"
'''
df = sql_query(query)
df["transcript"][0]

'I was hired by a woman with a lot of money. I don\'t know her name but I know she\'s around 5\'5" (65") or 5\'7" (67"). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n'

- Jeremy era solo un sicario.
- La que lo contrató mide entre 5'5" y 5'7"
- Es pelirroja
- Tiene un Tesla
- Fue al concierto sinfónico SQL 3 veces en Dic 2017

In [76]:
query = '''
SELECT a.name, b.height, b.car_model, b.hair_color, b.gender, a.id
FROM person as A
INNER JOIN drivers_license as B
ON a.license_id = b.id

WHERE b.hair_color = "red" AND b.gender = "female" AND b.car_model = "Model S" 
'''
sql_query(query)

               name  height car_model hair_color  gender     id
0          Red Korb      65   Model S        red  female  78881
1     Regina George      66   Model S        red  female  90700
2  Miranda Priestly      66   Model S        red  female  99716

In [74]:
query = '''
SELECT *
FROM facebook_event_checkin
WHERE event_name = "SQL Symphony Concert" AND date LIKE "201712%" AND person_id = "99716"
'''
sql_query(query)

   person_id  event_id            event_name      date
0      99716      1143  SQL Symphony Concert  20171206
1      99716      1143  SQL Symphony Concert  20171212
2      99716      1143  SQL Symphony Concert  20171229

La que lo contrató es Miranda Priestly

In [86]:
query = '''
SELECT *
FROM person
WHERE name = "Miranda Priestly"
'''
df = sql_query(query)
df

,id,name,license_id,address_number,address_street_name,ssn
0,99716,Miranda Priestly,202298,1883,Golden Ave,987756388

In [93]:
query = '''
SELECT a.name, b.annual_income
FROM person AS a
INNER JOIN income as B
ON a.ssn = b.ssn
WHERE a.name = "Miranda Priestly"
'''
df = sql_query(query)
df

               name  annual_income
0  Miranda Priestly         310000

MIRANDA ES EL CEREBRO DE TODO ESTO y Jeremy Bowers el sicario que contrató